// Дана json-строка (можно сохранить в файл и читать из файла)
// [{"фамилия":"Иванов","оценка":"5","предмет":"Математика"},{"фамилия":"Петрова","оценка":"4","предмет":"Информатика"},{"фамилия":"Краснов","оценка":"5","предмет":"Физика"}]
// Написать метод(ы), который распарсит json и, используя StringBuilder, создаст строки вида: Студент [фамилия] получил [оценка] по предмету [предмет].
// Пример вывода:
// Студент Иванов получил 5 по предмету Математика.
// Студент Петрова получил 4 по предмету Информатика.
// Студент Краснов получил 5 по предмету Физика.

public class Task3 {    
    private String params = "[{\"фамилия\":\"Иванов\",\"оценка\":\"5\",\"предмет\":\"Математика\"},{\"фамилия\":\"Петрова\",\"оценка\":\"4\",\"предмет\":\"Информатика\"},{\"фамилия\":\"Краснов\",\"оценка\":\"5\",\"предмет\":\"Физика\"}]";    
    public void buildStr() {
        StringBuilder sb = new StringBuilder();
        String paramsReplace = params.replace("\"фамилия\":\"", "").replace("\",\"оценка\":\"", " ").replace("\",\"предмет\":\"", " ").replace(",", " ").replace("{", "").replace("}", "").replace("[", "").replace("]", "").replace("\"", "");
        String[] array = paramsReplace.split(" ");                            
        for (int i = 0; i < array.length; i += 3) {
            sb.append("Студент(ка) " + array[0 + i] + " получил(а) " + array[1 + i] + " по предмету " + array[2 + i] + ".");
            System.out.println(sb);
            sb.setLength(0);
        }        
    }
}
